[{"Key":"4Q4CJRE8","Item.Type":"bookSection","Publication.Year":2014,"Author":"O’Sullivan, David","Title":"Spatial Network Analysis","Publication.Title":"Handbook of Regional Science","DOI":"","Abstract.Note":"","Date":"2014","Pages":"1253-1273","Editor":"Fischer, Manfred M.; Nijkamp, Peter"},{"Key":"QXZP6PB9","Item.Type":"journalArticle","Publication.Year":2001,"Author":"Haklay, M.; Schelhorn, T.; O'Sullivan, D.; Thurstain-Goodwin, M.","Title":"`So go down town': Simulating pedestrian movement in town centres","Publication.Title":"Environment and Planning B: Planning and Design","DOI":"","Abstract.Note":"","Date":"2001","Pages":"343–359","Volume":28,"Editor":""},{"Key":"KWNQ7Q8U","Item.Type":"bookSection","Publication.Year":2008,"Author":"Malpezzi, S.","Title":"Hedonic Pricing Models: A Selective and Applied Review","Publication.Title":"Housing Economics and Public Policy","DOI":"","Abstract.Note":"","Date":"2008","Pages":"67–89","Editor":"O'Sullivan, T.; Gibb, K."},{"Key":"29U3A5ZP","Item.Type":"journalArticle","Publication.Year":2009,"Author":"Wilson, Matthew W.; Poore, Barbara S.","Title":"Theory, Practice, and History in Critical GIS: Reports on an AAG Panel Session","Publication.Title":"Cartographica","DOI":"10.3138/carto.44.1.5","Abstract.Note":"Extending a special session held at the 2008 annual meeting of the Association of American Geographers in Boston, this commentary collection highlights elements of the critical GIS research agenda that are particularly pressing. Responding to a Progress report on critical GIS written by David O'Sullivan in 2006, these six commentaries discuss how different interpretations of ‘critical’ are traced through critical GIS research. Participants in the panel session discussed the need for a continued discussion of a code of ethics in GIS use in the context of ongoing efforts to alter or remake the software and its associated practices, of neo-geographies and volunteered geographies. There were continued calls for hope and practical ways to actualize this hope, and a recognition that critical GIS needs to remain relevant to the technology. This ‘relevance’ can be variously defined, and in doing so, researchers should consider their positioning vis-à-vis the technology. Throughout the commentaries collected here, a question remains as to what kind of work disciplinary sub-fields such as critical GIS and GIScience perform. This is a question about language, specifically the distance that language can create among practitioners and theoreticians, both in the case of critical GIS and more broadly throughout GIScience.","Date":"2009","Pages":"5-16","Issue":1,"Volume":44,"Editor":""},{"Key":"3V9SZIR8","Item.Type":"journalArticle","Publication.Year":2008,"Author":"O'Sullivan, David","Title":"Geographic information science: agent-based models","Publication.Title":"Progress in Human Geography","DOI":"","Abstract.Note":"","Date":"2008","Pages":"541–550","Volume":32,"Editor":""},{"Key":"WUDJMIZZ","Item.Type":"journalArticle","Publication.Year":2005,"Author":"O'Sullivan, David","Title":"Geographical information science: time changes everything","Publication.Title":"Progress in Human Geography","DOI":"10.1191/0309132505ph581pr","Abstract.Note":"","Date":"2005","Pages":"749–756","Issue":6,"Volume":29,"Editor":""},{"Key":"8CGCN28B","Item.Type":"journalArticle","Publication.Year":2004,"Author":"O'Sullivan, David","Title":"Complexity science and human geography","Publication.Title":"Transactions of the Institute of British Geographers","DOI":"10.1111/j.0020-2754.2004.00321.x","Abstract.Note":"","Date":"2004","Pages":"282–295","Issue":3,"Volume":29,"Editor":""},{"Key":"2ECXUW7X","Item.Type":"journalArticle","Publication.Year":2002,"Author":"O'Sullivan, D.","Title":"Toward micro-scale spatial modeling of gentrification","Publication.Title":"Journal of Geographical Systems","DOI":"10.1007/s101090200086","Abstract.Note":"A simple preliminary model of gentrification is presented. The model is based on an irregular cellular automaton architecture drawing on the concept of proximal space, which is well suited to the spatial externalities present in housing markets at the local scale. The rent gap hypothesis on which the model's cell transition rules are based is discussed. The model's transition rules are described in detail. Practical difficulties in configuring and initializing the model are described and its typical behavior reported. Prospects for further development of the model are discussed. The current model structure, while inadequate, is well suited to further elaboration and the incorporation of other interesting and relevant effects. ABSTRACT FROM AUTHOR","Date":"2002","Pages":"251–274","Issue":3,"Volume":4,"Editor":""},{"Key":"IINB5U8M","Item.Type":"journalArticle","Publication.Year":2001,"Author":"O'Sullivan, David","Title":"Graph cellular automata: a generalised discrete urban and regional model","Publication.Title":"Environment and Planning B: Planning & Design","DOI":"10.1068/b2707","Abstract.Note":"","Date":"2001","Pages":"687–705","Issue":5,"Volume":28,"Editor":""},{"Key":"26V3N4JX","Item.Type":"journalArticle","Publication.Year":2009,"Author":"O'Sullivan, David; Perry, George L. W.","Title":"A discrete space model for continuous space dispersal processes","Publication.Title":"Ecological Informatics","DOI":"10.1016/j.ecoinf.2009.03.001","Abstract.Note":"","Date":"2009","Pages":"57–68","Issue":2,"Volume":4,"Editor":""},{"Key":"EFD7D5UJ","Item.Type":"book","Publication.Year":2010,"Author":"O'Sullivan, David; Unwin, David J.","Title":"Geographic Information Analysis","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2010","Pages":"","Editor":""},{"Key":"SDBZ4XNU","Item.Type":"bookSection","Publication.Year":2012,"Author":"O'Sullivan, David; Millington, James D. A.; Perry, George L. W.; Wainwright, John","Title":"Agent-based models: because they're worth it?","Publication.Title":"Agent-Based Models for Geographical Systems.","DOI":"","Abstract.Note":"","Date":"2012","Pages":"109–123","Editor":"Heppenstall, Alison J.; Crooks, Andrew T.; See, Linda M.; Batty, Michael"},{"Key":"C8SP3ZVW","Item.Type":"journalArticle","Publication.Year":2008,"Author":"Reardon, Sean F.; Matthews, Stephen A.; O'Sullivan, David; Lee, B. A.; Firebaugh, Glenn; Farrell, Chad R.; Bischoff, Kendra","Title":"Online supplement to “The Geographical Scale of Metropolitan Racial Segregation.","Publication.Title":"Demography","DOI":"","Abstract.Note":"","Date":"2008","Pages":"489–514","Volume":45,"Editor":""},{"Key":"XBPSPMP8","Item.Type":"conferencePaper","Publication.Year":2005,"Author":"O'Sullivan, David; Macgill, James","Title":"Modelling urban residential neighbourhood dynamics","Publication.Title":"EXYSTENCE Workshop on Modelling Urban Social Dynamics","DOI":"","Abstract.Note":"","Date":"2005","Pages":"","Editor":""},{"Key":"SDNK6WDQ","Item.Type":"conferencePaper","Publication.Year":2003,"Author":"O'Sullivan, David; Macgill, J. M.; Yu, Chaoqiing","Title":"Agent-based residential segregation: a hierarchically structured spatial model","Publication.Title":"Agent 2003 ‘Challenges in Social Simulation'","DOI":"","Abstract.Note":"In this paper we present a variation on Schelling’s model of residential location dynamics that combines two concepts of neighborhood: the continuous neighborhood and the bounded neighborhood. Schelling’s model is described in outline. The structure of the current model is described in detail. The effect on model behavior of varying the size of bounded neighborhoods while also varying the balance between local and regional level effects on agent behavior is explored, and preliminary results are reported. The scale of bounded neighborhoods considered by agents in making residential location decisions has important impacts on overall model outcomes. A range of possibilities for further work is discussed.","Date":"2003","Pages":"","Editor":""},{"Key":"S5NE8VUZ","Item.Type":"journalArticle","Publication.Year":2000,"Author":"O'Sullivan, David; Haklay, M.","Title":"Agent-based models and individualism: is the world agent-based?","Publication.Title":"Environment and Planning - Part A","DOI":"","Abstract.Note":"Agent-based models (ABMs) are an increasingly popular tool in the social sciences. This trend seems likely to continue, so that they will become widely used in geography and in urban and regional planning. We present an overview of examples of these models in the life sciences, economics, planning, sociology, and archaeology. We conclude that ABMs strongly tend towards an individualist view of the social world. This point is reinforced by closer consideration of particular examples. This discussion pays attention to the inadequacy of an individualist model of society with reference to debates in social theory. We argue that because models are closed representations of an open world it is important that institutions and other social structures be explicitly included, or that their omission be explained. A tentative explanation for the bias of ABMs is offered, based on an examination of early research in artificial intelligence and distributed artificial intelligence from which disciplines the approach is derived. Some implications of these findings are discussed. We indicate some useful research directions which are beginning to tackle the individualism issue directly. We further note that the underlying assumptions of ABMs are often hidden in the implementation details. We conclude that such models must be subject to critical examination of their assumptions, and that model builders should engage with social theory if the approach is to realise its full potential.","Date":"2000","Pages":"1409-1425","Issue":8,"Volume":32,"Editor":""},{"Key":"9NZF3UIG","Item.Type":"journalArticle","Publication.Year":2009,"Author":"O'Sullivan, David","Title":"Changing Neighborhoods–Neighborhoods Changing: A Framework for Spatially Explicit Agent-Based Models of Social Systems","Publication.Title":"Sociological Methods Research","DOI":"10.1177/0049124109334793","Abstract.Note":"The nature of urban neighborhoods, neighborhood effects, and the dynamics of residential segregation are important themes in contemporary sociological inquiry. Agent-based models of social systems have been widely applied in this context. However, both applied and model-based research in these areas suffer from weaknesses in underlying conceptualizations and representations of spatial context. Drawing on human geography and the socio spatial perspective in urban sociology, a framework that enables richer and more realistic representation of urban neighborhoods in agent-based simulation models is proposed and outlined. The framework relies on a graph representation of the spatial relations among spatial locations and can accommodate well defined administrative zones, vague or ill-defined neighborhoods, hierarchically nested spatial zoning systems, overlapping neighborhoods, and changing relations among neighborhoods. Results from a preliminary application of the framework demonstrate its utility and possibilities for research into the effects of neighborhood structure on social processes. (PsycINFO Database Record (c) 2010 APA, all rights reserved) (journal abstract)","Date":"2009","Pages":"498–530","Issue":4,"Volume":37,"Editor":""},{"Key":"3TB3CGF8","Item.Type":"conferencePaper","Publication.Year":2006,"Author":"O'Sullivan, David; Perry, George L. W.","Title":"An Approach to Simulating Local Diffusion Processes over Large Landscapes","Publication.Title":"SIRC 2006 - The 18th Annual Colloquium of the Spatial Information Research Centre","DOI":"","Abstract.Note":"The simulation of spatial diffusion processes using both individual- (or agent-) based and cellular approaches has become commonplace in a range of disciplines. In the context of plant dispersal dynamics, models have focussed on one of two scales: local or regional. In particle systems models plants are modelled individually, with plant locations at continuous coordinates on grids at a resolution approximating the size of individual plants (< ∼10m), seed dispersion processes represented stochastically and sometimes in considerable mechanistic detail, and study areas ranging up to around only 2x2km (i.e. 4km2). Alternatively, regional-scale models represent only ’presence’ or ’absence’ of species on grids with cell sizes typically ∼1km or greater and highly abstracted diffusion processes. In this paper, we present a preliminary model for regional-scale modelling of plant dispersal dynamics that can accommodate more detailed cell-by-cell variation in plant density, but which accounts for local scales of spread using the classical probability result of ’Buffon’s Needle’ as recently advocated by Birch (Ecol. Mod. 192: 637-644). In this approach the model represents local sub-populations explicitly but uses statistical approximations to model adequately local-dispersal processes at scales typically less than 10m, on a grid with a resolution of 100m (or greater). Rare long distance dispersal events, which are known to be an important component of seed dispersal, are conveniently modelled in this context via a simple stochastic process. This approach holds out the prospect of computationally efficient simulations of spread across large heterogeneous landscapes, but which remain remain faithful to empirical data on the spread of particular species, and that are useful in management applications. The model in its current form will be described, including facilities for generation of suitability landscapes that enable exploration of spread dynamics on the complex fragmented landscapes seen in contemporary peri-urban settings. Prospects for experimental exploration of invasive spread dynamics and control strategies will be discussed.","Date":"2006","Pages":"","Editor":"Whigham, Peter"},{"Key":"E8DGZH55","Item.Type":"journalArticle","Publication.Year":2000,"Author":"O'Sullivan, David; Alastair Morrison; Shearer, John","Title":"Using desktop GIS for the investigation of accessibility by public transport: an isochrone approach","Publication.Title":"International Journal of Geographical Information Science","DOI":"10.1080/136588100240976","Abstract.Note":"Abstract. The application of existing desktop geographical information systems (GIS) to the assessment of accessibility by public transport has been investigated. Two approaches to the measurement of accessibility aggregate accessibility measures and the space-time geography framework are described. It is suggested that isochrones (lines of equal travel time) are a natural way to combine these approaches in a GIS setting. A desktop GIS application has been developed which can automatically generate isochrones for travel by public transport. The application successfully copes with the complexity of the public transport of a large city (Glasgow), comprising bus, rail, and underground services. Journeys may include an initial walk to a public transport stop, several interchanges between services of the same or di erentmodes, and a nal walk.Options provide for plotting isochrones for journeys by bus only or train only; and for exact or approximate isochrones, the latter generated more quickly. The application is described in some detail, and assessed. Sample outputs are presented, including an example involving further processing of isochrones to produce a constrained accessibility map, which demonstrates the generality of this approach.","Date":"2000","Pages":"85-104","Issue":1,"Volume":14,"Editor":""},{"Key":"8XJNB5NG","Item.Type":"journalArticle","Publication.Year":2001,"Author":"Torrens, P. M.; O'Sullivan, David","Title":"Cellular automata and urban simulation: where do we go from here?","Publication.Title":"Environment and Planning B: Planning and Design","DOI":"10.1068/b2802ed","Abstract.Note":"Cellular Automata (CA) is a spatial simulation technique that has been the subject of intensive research for the last two decades. This technique has its theoretical origins in the 1940s with the research effort made by von Neumann and Ulam for devising mathematical rules for the evolution of biological systems. The intrinsic spatial character of CA suggested their introduction to quantitative geography by Tobler in the 1970s. In this chapter, we firstly present a concise literature survey on CA and their use in geography. The mathematical formulation of CA is presented, as well as their main applications to urban geography and urban studies. The discussion over important CA relaxations is introduced. In the second part of the chapter we present a series of recent developments regarding the use of geographic CA. Two main issues constitute the core of these developments: the choice of the modeling scale and the use of irregular cells. The development of a CA model for simulating change in small urban areas is presented. The use of irregular cells in opposition to the classical regular, pixel-based cells is also discussed. Finally, a reflection is made about future trends in a multi-scale CA for modeling urban and regional growth.","Date":"2001","Pages":"163–168","Issue":2,"Volume":28,"Editor":""},{"Key":"R2UHRIZM","Item.Type":"journalArticle","Publication.Year":2006,"Author":"Rygel, Lisa; O'Sullivan, David; Yarnal, Brent","Title":"A Method for Constructing a Social Vulnerability Index: An Application to Hurricane Storm Surges in a Developed Country","Publication.Title":"Mitigation and Adaptation Strategies for Global Change","DOI":"10.1007/s11027-006-0265-6","Abstract.Note":"","Date":"2006-05","Pages":"741–764","Issue":3,"Volume":11,"Editor":""},{"Key":"CHJXKXTV","Item.Type":"journalArticle","Publication.Year":2011,"Author":"Mateos, Pablo; Longley, Paul A.; O'Sullivan, David","Title":"Ethnicity and Population Structure in Personal Naming Networks","Publication.Title":"PLoS ONE","DOI":"10.1371/journal.pone.0022943","Abstract.Note":"Personal naming practices exist in all human groups and are far from random. Rather, they continue to reflect social norms and ethno-cultural customs that have developed over generations. As a consequence, contemporary name frequency distributions retain distinct geographic, social and ethno-cultural patterning that can be exploited to understand population structure in human biology, public health and social science. Previous attempts to detect and delineate such structure in large populations have entailed extensive empirical analysis of naming conventions in different parts of the world without seeking any general or automated methods of population classification by ethno-cultural origin. Here we show how ‘naming networks’, constructed from forename-surname pairs of a large sample of the contemporary human population in 17 countries, provide a valuable representation of cultural, ethnic and linguistic population structure around the world. This innovative approach enriches and adds value to automated population classification through conventional national data sources such as telephone directories and electoral registers. The method identifies clear social and ethno-cultural clusters in such naming networks that extend far beyond the geographic areas in which particular names originated, and that are preserved even after international migration. Moreover, one of the most striking findings of this approach is that these clusters simply ‘emerge’ from the aggregation of millions of individual decisions on parental naming practices for their children, without any prior knowledge introduced by the researcher. Our probabilistic approach to community assignment, both at city level as well as at a global scale, helps to reveal the degree of isolation, integration or overlap between human populations in our rapidly globalising world. As such, this work has important implications for research in population genetics, public health, and social science adding new understandings of migration, identity, integration and social interaction across the world.","Date":"2011-09","Pages":"e22943","Issue":9,"Volume":6,"Editor":""},{"Key":"DG2C89TQ","Item.Type":"journalArticle","Publication.Year":2001,"Author":"Turner, Alasdair; Doxa, Maria; O'Sullivan, David; Penn, Alan","Title":"From isovists to visibility graphs: a methodology for the analysis of architectural space","Publication.Title":"Environment and Planning B: Planning and Design","DOI":"10.1068/b2684","Abstract.Note":"An isovist, or viewshed, is the area in a spatial environment directly visible from a location within the space. Here we show how a set of isovists can be used to generate a graph of mutual visibility between locations. We demonstrate that this graph can also be constructed without reference to isovists and that we are in fact invoking the more general concept of a visibility graph. Using the visibility graph, we can extend both isovist and current graph-based analyses of architectural space to form a new methodology for the investigation of configurational relationships. The measurement of local and global characteristics of the graph, for each vertex or for the system as a whole, is of interest from an architectural perspective, allowing us to describe a configuration with reference to accessibility and visibility, to compare from location to location within a system, and to compare systems with different geometries. Finally we show that visibility graph properties may be closely related to manifestations of spatial perception, such as way-finding, movement, and space use.","Date":"2001","Pages":"103–121","Issue":1,"Volume":28,"Editor":""},{"Key":"T68HR6F3","Item.Type":"journalArticle","Publication.Year":2007,"Author":"O'Sullivan, David; Wong, David W. S.","Title":"A Surface-Based Approach to Measuring Spatial Segregation","Publication.Title":"Geographical Analysis","DOI":"10.1111/j.1538-4632.2007.00699.x","Abstract.Note":"Quantitative indices of residential segregation have been with us for half a century, but suffer significant limitations. While useful for comparison among regions, summary indices fail to reveal spatial aspects of segregation. Such measures generally consider only the population mix within zones, not between them. Zone boundaries are treated as impenetrable barriers to interaction between population subgroups, so that measurement of segregation is constrained by the zoning system, which bears no necessary relation to interaction among population subgroups. A segregation measurement approach less constrained by the chosen zoning system, which enables visualization of segregation levels at the local scale and accounts for the spatial dimension of segregation, is required. We propose a kernel density estimation approach to model spatial aspects of segregation. This provides an explicitly geographical framework for modeling and visualizing local spatial segregation. The density estimation approach lends itself to development of an index of spatial segregation with the advantage of functional compatibility with the most widely used index of segregation (the dissimilarity index D). We provide a short review of the literature on measuring segregation, briefly describe the kernel density estimation method, and illustrate how the method can be used for measuring segregation. Examples using a simulated landscape and two empirical cases in Washington, DC and Philadelphia, PA are presented","Date":"2007","Pages":"147–168","Issue":2,"Volume":39,"Editor":""},{"Key":"QFQ6TZPC","Item.Type":"thesis","Publication.Year":1997,"Author":"O'Sullivan, David","Title":"Using GIS to create public transport travel time isochrones for the Glasgow area","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"1997","Pages":"","Editor":""},{"Key":"5QAS7Z9Q","Item.Type":"bookSection","Publication.Year":2004,"Author":"O'Sullivan, David","Title":"Too much of the wrong kind of data. Implications for the practice of micro-scale spatial modeling","Publication.Title":"Spatially Integrated Social Science","DOI":"","Abstract.Note":"","Date":"2004","Pages":"95–108","Editor":"Goodchild, Michael F; Janelle, Donald G"},{"Key":"RMBN55KF","Item.Type":"journalArticle","Publication.Year":2011,"Author":"Xue, Jingjing; Friesen, Wardlow; O'Sullivan, David","Title":"Diversity in Chinese Auckland: Hypothesising Multiple Ethnoburbs","Publication.Title":"Population, Space and Place","DOI":"10.1002/psp.688","Abstract.Note":"","Date":"2011-08","Pages":"n/a–n/a","Editor":""},{"Key":"UJK2FKDS","Item.Type":"journalArticle","Publication.Year":2008,"Author":"Lee, B. A.; Reardon, Sean F.; Firebaugh, Glenn; Farrell, Chad R.; Matthews, Stephen A.; O'Sullivan, David","Title":"Beyond the Census Tract: Patterns and Determinants of Racial Segregation at Multiple Geographic Scales","Publication.Title":"American Sociological Review","DOI":"10.1177/000312240807300504","Abstract.Note":"The census tractbased residential segregation literature rests on problematic assumptions about geographic scale and proximity. We pursue a new tract-free approach that combines explicitly spatial concepts and methods to examine racial segregation across egocentric local environments of varying size. Using 2000 Census data for the 100 largest U.S. metropolitan areas, we compute a spatially modified version of the information theory index H to describe patterns of BlackWhite, Hispanic-White, Asian-White, and multigroup segregation at different scales. We identify the metropolitan structural characteristics that best distinguish micro-segregation from macro-segregation for each group combination, and we decompose their effects into portions due to racial variation occurring over short and long distances. A comparison of our results with those from tract-based analyses confirms the value of the new approach.","Date":"2008","Pages":"766–791","Issue":5,"Volume":73,"Editor":""},{"Key":"THFKT4ME","Item.Type":"book","Publication.Year":2003,"Author":"O'Sullivan, David; Unwin, David J.","Title":"Geographic Information Analysis","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2003","Pages":"","Editor":""},{"Key":"5572QCQ9","Item.Type":"journalArticle","Publication.Year":2001,"Author":"Torrens, P. M.; O'Sullivan, David","Title":"Cities, cells, and complexity: developing a research agenda for urban geocomputation","Publication.Title":"","DOI":"","Abstract.Note":"Cellular automata are widely employed in urban geocomputation and have been applied to urban systems simulation with a recent fervour. Despite the popularity of these models, however, researchers have been slow to heed the doubts and disclaimers expressed in the early days of their application to urban phenomena. This is, in part, a response to advances in the field. However, many of these concerns remain as appropriate today as they did in the 1980s, and have not been addressed largely because the study of cellular urban modelling, and the broader field of urban geocomputation, lacks a defined research agenda. This paper addresses an apparent imbalance in the field and re-evaluates the research agenda of urban geocomputation, in particular cellular-based modelling of urban systems, pre-emptively suggesting future avenues for exploration and considering the challenges that might lie ahead.","Date":"2001","Pages":"","Editor":""},{"Key":"JV24B4HU","Item.Type":"journalArticle","Publication.Year":2001,"Author":"O'Sullivan, David; Turner, Alasdair","Title":"Visibility graphs and landscape visibility analysis","Publication.Title":"International Journal of Geographical Information Science","DOI":"10.1080/13658810151072859","Abstract.Note":"","Date":"2001","Pages":"221-237","Issue":3,"Volume":15,"Editor":""},{"Key":"I9RZ7F7Z","Item.Type":"journalArticle","Publication.Year":2001,"Author":"O'Sullivan, David","Title":"Exploring spatial process dynamics using irregular cellular automaton models","Publication.Title":"Geographical Analysis","DOI":"","Abstract.Note":"","Date":"2001","Pages":"1–18","Issue":1,"Volume":33,"Editor":""},{"Key":"8ZBGXNAC","Item.Type":"journalArticle","Publication.Year":2008,"Author":"O'Sullivan, David","Title":"Geographical information science: agent-based models","Publication.Title":"Progress in Human Geography","DOI":"10.1177/0309132507086879","Abstract.Note":"","Date":"2008","Pages":"541–550","Issue":4,"Volume":32,"Editor":""},{"Key":"S4ZD4IAM","Item.Type":"journalArticle","Publication.Year":2006,"Author":"O'Sullivan, David","Title":"Geographical information science: critical GIS","Publication.Title":"Progress in Human Geography","DOI":"10.1177/0309132506071528","Abstract.Note":"The article presents a critical analysis of a growing body of research work that connects human geography with geographic information systems. The author analyzes the origin and development of the concept of \"critical GIS\" that was discussed in the works of Nadine Schuurman, Pickles, Sheppard and Chrisman. The author also discuses the seven research agenda themes of Sheppard in which he explained the progress on 'GIS and society.' The author also presents an overview of the most vital elements in 'Critical GIS' and also discuses the success of emerging works in feminist GIS, participatory GIS. The author also analyzes the moral and ethical aspects arising out of the use of these technologies in terms of being a threat to privacy of individuals.","Date":"2006","Pages":"783–791","Issue":6,"Volume":30,"Editor":""},{"Key":"KDH8INWB","Item.Type":"journalArticle","Publication.Year":2005,"Author":"Crawford, Thomas W.; Messina, Joseph P.; Manson, Steven M.; O'Sullivan, David","Title":"Complexity science, complex systems, and land-use research","Publication.Title":"Environment and Planning B: Planning and Design","DOI":"10.1068/b3206ed","Abstract.Note":"","Date":"2005","Pages":"792–798","Issue":6,"Volume":32,"Editor":""},{"Key":"2X3N5KKS","Item.Type":"journalArticle","Publication.Year":2006,"Author":"Manson, Steven M.; O’Sullivan, David","Title":"Complexity theory in the study of space and place","Publication.Title":"Environment and Planning A","DOI":"10.1068/a37100","Abstract.Note":"Researchers across disciplines apply complexity theory to issues ranging from economic development to earthquake prediction. The breadth of applications speaks to the promise of complexity theory, but there remain a number of challenges to be met, particularly those related to its ontological and epistemological dimensions. We identify a number of key issues by asking three questions. Does complexity theory operate at too general a level to enhance understanding? What are the ontological and epistemological implications of complexity? What are the challenges in modeling complexity? In answering these questions, we argue that, although complexity offers much to the study of place and space, research in these areas has a number of strengths that enhance complexity research","Date":"2006","Pages":"677–692","Issue":4,"Volume":38,"Editor":""},{"Key":"FVUGC27S","Item.Type":"journalArticle","Publication.Year":2014,"Author":"O’Sullivan, David","Title":"Don’t panic! The need for change and for curricular pluralism","Publication.Title":"Dialogues in Human Geography","DOI":"10.1177/2043820614525712","Abstract.Note":"The proposal for a more quantitative geography curriculum from Johnston et al. (2014) is a welcome contribution to ongoing debates. However, their arguments rely in part on an overly pessimistic assessment of the current status of quantitative methods in the discipline – perhaps reflecting their UK focus. They also underplay the importance of geometry and the models of theoretical geography to any comprehensive treatment of quantitative methods in contemporary geography. These are themes that should be considered in any modern geography curriculum. The future of quantitative methods in geography seems secure and is likely to lead to different curricula in different geographical contexts.","Date":"2014-03-01","Pages":"39-44","Issue":1,"Volume":4,"Editor":""},{"Key":"S627QBH4","Item.Type":"journalArticle","Publication.Year":2004,"Author":"Reardon, Sean F.; O’Sullivan, David","Title":"Measures of Spatial Segregation","Publication.Title":"Sociological Methodology","DOI":"10.1111/j.0081-1750.2004.00150.x","Abstract.Note":"The measurement of residential segregation patterns and trends has been limited by a reliance on segregation measures that do not appropriately take into account the spatial patterning of population distributions. In this paper we define a general approach to measuring spatial segregation among multiple population groups. This general approach allows researchers to specify any theoretically based definition of spatial proximity desired in computing segregation measures. Based on this general approach, we develop a general spatial exposure/isolation index (P̃*), and a set of general multigroup spatial evenness/clustering indices: a spatial information theory index (H̃), a spatial relative diversity index (R̃), and a spatial dissimilarity index (D̃). We review these and previously proposed spatial segregation indices against a set of eight desirable properties of spatial segregation indices. We conclude that the spatial exposure/isolation index P̃*—which can be interpreted as a measure of the average composition of individuals’ local spatial environments—and the spatial information theory index H̃—which can be interpreted as a measure of the variation in the diversity of the local spatial environments of each individual—are the most conceptually and mathematically satisfactory of the proposed spatial indices.","Date":"2004-12-01","Pages":"121-162","Issue":1,"Volume":34,"Editor":""},{"Key":"A5G7RQ9M","Item.Type":"journalArticle","Publication.Year":2009,"Author":"Reardon, Sean F.; Farrell, Chad R.; Matthews, Stephen A.; O’Sullivan, David; Bischoff, Kendra; Firebaugh, Glenn","Title":"Race and space in the 1990s: Changes in the geographic scale of racial residential segregation, 1990–2000","Publication.Title":"Social Science Research","DOI":"10.1016/j.ssresearch.2008.10.002","Abstract.Note":"","Date":"2009-03","Pages":"55-70","Issue":1,"Volume":38,"Editor":""},{"Key":"EKJUHXK6","Item.Type":"journalArticle","Publication.Year":2012,"Author":"Mavoa, Suzanne; Witten, Karen; McCreanor, Tim; O’Sullivan, David","Title":"GIS based destination accessibility via public transit and walking in Auckland, New Zealand","Publication.Title":"Journal of Transport Geography","DOI":"10.1016/j.jtrangeo.2011.10.001","Abstract.Note":"","Date":"2012-01","Pages":"15-22","Issue":1,"Volume":20,"Editor":""},{"Key":"642VJ6P8","Item.Type":"bookSection","Publication.Year":2009,"Author":"O’Sullivan, D.","Title":"Complexity Theory, Nonlinear Dynamic Spatial Systems","Publication.Title":"International Encyclopedia of Human Geography","DOI":"","Abstract.Note":"This article provides an overview of the origins of complexity science, a summary of its ontological and epistemological implications, and a discussion of those implications for human geography. It is argued that the currently dominant North American perspectives on complexity science have their origins in post-World War II optimism concerning the applicability of computational approaches to systems of organized complexity. Systems of organized complexity are considered to be intermediate between simple systems with few interactions between elements, and large systems with many millions of elements whose behavior is adequately described in statistical terms. Such systems exhibit a number of expected structural and behavioral characteristics. Aspects of structure include distinctive hierarchical or networked patterns of organization. Behavioral characteristics of interest may include emergence, self-organization, chaotic dynamics, positive feedback, path dependence, and tipping points, and each of these is considered in turn. The important role of computational modeling in the study of complex systems is discussed with particular attention paid to the importance of the unsolved problem of validating the representational adequacy of any computational model. Finally, the relatively limited impact to date of complexity science in human geography is discussed, and prospects for future engagement are considered.","Date":"2009","Pages":"239-244","Editor":"Kitchin, Rob; Thrift, Nigel J."},{"Key":"JA35NUQ2","Item.Type":"journalArticle","Publication.Year":2012,"Author":"Millington, James D. A.; O’Sullivan, David; Perry, George L. W.","Title":"Model histories: Narrative explanation in generative simulation modelling","Publication.Title":"Geoforum","DOI":"10.1016/j.geoforum.2012.06.017","Abstract.Note":"The increasing use of computer simulation modelling brings with it epistemological questions about the possibilities and limits of its use for understanding spatio-temporal dynamics of social and environmental systems. These questions include how we learn from simulation models and how we most appropriately explain what we have learnt. Generative simulation modelling provides a framework to investigate how the interactions of individual heterogeneous entities across space and through time produce system-level patterns. This modelling approach includes individual- and agent-based models and is increasingly being applied to study environmental and social systems, and their interactions with one another. Much of the formally presented analysis and interpretation of this type of simulation resorts to statistical summaries of aggregated, system-level patterns. Here, we argue that generative simulation modelling can be recognised as being ‘event-driven’, retaining a history in the patterns produced via simulated events and interactions. Consequently, we explore how a narrative approach might use this simulated history to better explain how patterns are produced as a result of model structure, and we provide an example of this approach using variations of a simulation model of breeding synchrony in bird colonies. This example illustrates not only why observed patterns are produced in this particular case, but also how generative simulation models function more generally. Aggregated summaries of emergent system-level patterns will remain an important component of modellers’ toolkits, but narratives can act as an intermediary between formal descriptions of model structure and these summaries. Using a narrative approach should help generative simulation modellers to better communicate the process by which they learn so that their activities and results can be more widely interpreted. In turn, this will allow non-modellers to foster a fuller appreciation of the function and benefits of generative simulation modelling.","Date":"2012-11","Pages":"1025-1034","Issue":6,"Volume":43,"Editor":""},{"Key":"DXT62C3K","Item.Type":"journalArticle","Publication.Year":2015,"Author":"Etherington, Thomas R.; Holland, E. Penelope; O'Sullivan, David","Title":"NLMpy: a python software package for the creation of neutral landscape models within a general numerical framework","Publication.Title":"Methods in Ecology and Evolution","DOI":"10.1111/2041-210X.12308","Abstract.Note":"* Neutral landscape models (NLMs) are widely used to model ecological patterns and processes across landscapes. However, the ability to generate NLMs is often made available through standalone bespoke software packages that have platform limitations. * We have developed a python package that brings together some of the more popular NLM algorithms using a general numerical framework. * The resulting NLMpy package: (i) allows for the creation of NLMs directly within a python modelling workflow or by other modelling software capable executing a python script, (ii) enables the first opportunity to create a NLM that combines different algorithms, (iii) provides easy integration with geographic information system data and (iv) creates a framework for developing other NLMs.","Date":"2015","Pages":"164-168","Issue":2,"Volume":6,"Editor":""},{"Key":"R8GCSB6J","Item.Type":"book","Publication.Year":2014,"Author":"Coleman, Gabriella","Title":"Hacker, Hoaxer, Whistleblower, Spy: The Many Faces of Anonymous","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2014","Pages":"","Editor":""},{"Key":"T3BJ26NA","Item.Type":"book","Publication.Year":2015,"Author":"Wark, McKenzie","Title":"Molecular Red: Theory for the Anthropocene","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2015","Pages":"","Editor":""},{"Key":"ES8N3G4J","Item.Type":"book","Publication.Year":2008,"Author":"Badiou, Alain","Title":"The Communist Hypothesis","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2008","Pages":"","Editor":""},{"Key":"ZA9JH9DD","Item.Type":"journalArticle","Publication.Year":2015,"Author":"O’Sullivan, David","Title":"<b>Exploring spatial scale in geography<\/b> , by Christopher D. Lloyd, Chichester, UK, JohnWiley &amp; Sons, 2014, 272 pp., £75.00, €93.80, $94.30 (hardback), ISBN 978-1-119-97135-1","Publication.Title":"International Journal of Geographical Information Science","DOI":"10.1080/13658816.2015.1053890","Abstract.Note":"","Date":"2015-06-03","Pages":"1-2","Editor":""},{"Key":"EJQZI6EK","Item.Type":"journalArticle","Publication.Year":2015,"Author":"Cheung, Alan Kwok Lun; O’Sullivan, D.; Brierley, Gary","Title":"Graph-assisted landscape monitoring","Publication.Title":"International Journal of Geographical Information Science","DOI":"10.1080/13658816.2014.989856","Abstract.Note":"The structure of computational spatial analysis has mostly built on data lattices inherited from cartography, where visualization of information takes priority over analysis. In these framings, spatial relationships cannot easily be encoded into traditional data lattices. This hinders spatial analysis that emphasizes how interactions among spatial entities reflect mutual inter-relationships. This paper explores how graph theoretic principles can support spatiotemporal analysis by enabling assessment of spatial and temporal relationships in landscape monitoring.","Date":"2015-04-03","Pages":"580-605","Issue":4,"Volume":29,"Editor":""},{"Key":"GQI47QFP","Item.Type":"journalArticle","Publication.Year":2015,"Author":"O’Sullivan, David; Manson, Steven M.","Title":"Do Physicists Have Geography Envy? And What Can Geographers Learn from It?","Publication.Title":"Annals of the Association of American Geographers","DOI":"10.1080/00045608.2015.1039105","Abstract.Note":"Recent years have seen an increasing amount of work by physicists on topics outside their traditional research domain, including geography. We explore the scope of this development, place it in a historical context dating back at least to statistical physics in the nineteenth century and trace the origins of more recent developments to the roots of computational science after World War II. Our primary purpose is not historical, however. Instead, we are concerned with understanding what geographers can learn from the many recent contributions by physicists to understanding spatiotemporal systems. Drawing on examples of work in this tradition by physicists, we argue that two apparently different modes of investigation are common: model-driven and data-driven approaches. The former is associated with complexity science, whereas the latter is more commonly associated with the fourth paradigm, more recently known as “big data.” Both modes share technical strengths and, more important, a capacity for generalization, which is absent from much work in geography. We argue that although some of this research lacks an appreciation of previous geographical contributions, when assessed critically, it nevertheless brings useful new perspectives, new methods, and new ideas to bear on topics central to geography, yet neglected in the discipline. We conclude with some suggestions for how geographers can build on these new approaches, both inside and outside the discipline.","Date":"2015-07-04","Pages":"704-722","Issue":4,"Volume":105,"Editor":""},{"Key":"W5C974HU","Item.Type":"journalArticle","Publication.Year":2015,"Author":"O’Sullivan, David","Title":"Book Review: Lloyd, C.D. Exploring spatial scale in geography","Publication.Title":"International Journal of Geographical Information Science","DOI":"10.1080/13658816.2015.1053890","Abstract.Note":"","Date":"2015-10-03","Pages":"1932-1933","Issue":10,"Volume":29,"Editor":""},{"Key":"IE5J6338","Item.Type":"bookSection","Publication.Year":2015,"Author":"Pfeffer, Karin; Martinez, Javier; O’Sullivan, David; Scott, Dianne","Title":"Geo-Technologies for Spatial Knowledge: Challenges for Inclusive and Sustainable Urban Development","Publication.Title":"Geographies of Urban Governance","DOI":"","Abstract.Note":"","Date":"2015","Pages":"147-173","Editor":"Gupta, Joyeeta; Pfeffer, Karin; Verrest, Hebe; Ros-Tonen, Mirjam"},{"Key":"RDTTHFUG","Item.Type":"journalArticle","Publication.Year":2012,"Author":"Xue, Jingjing; Friesen, Wardlow; O'Sullivan, David","Title":"Diversity in Chinese Auckland: Hypothesising Multiple Ethnoburbs: Diversity in Chinese Auckland","Publication.Title":"Population, Space and Place","DOI":"10.1002/psp.688","Abstract.Note":"","Date":"2012-09","Pages":"579-595","Issue":5,"Volume":18,"Editor":""},{"Key":"IFWASWUI","Item.Type":"journalArticle","Publication.Year":2016,"Author":"Thatcher, J.; Bergmann, L.; Ricker, B.; Rose-Redwood, R.; O'Sullivan, D.; Barnes, T. J.; Barnesmoore, L. R.; Beltz Imaoka, L.; Burns, R.; Cinnamon, J.; Dalton, C. M.; Davis, C.; Dunn, S.; Harvey, F.; Jung, J.-K.; Kersten, E.; Knigge, L.; Lally, N.; Lin, W.; Mahmoudi, D.; Martin, M.; Payne, W.; Sheikh, A.; Shelton, T.; Sheppard, E.; Strother, C. W.; Tarr, A.; Wilson, M. W.; Young, J. C.","Title":"Revisiting critical GIS","Publication.Title":"Environment and Planning A","DOI":"10.1177/0308518X15622208","Abstract.Note":"","Date":"2016-05-01","Pages":"815-824","Issue":5,"Volume":48,"Editor":""},{"Key":"HKM5H3P2","Item.Type":"journalArticle","Publication.Year":2008,"Author":"Reardon, Sean F.; Matthews, Stephen A.; O'Sullivan, David; Lee, Barrett A.; Firebaugh, Glenn; Farrell, Chad R.; Bischoff, Kendra","Title":"The Geographic Scale of Metropolitan Racial Segregation","Publication.Title":"Demography","DOI":"10.1353/dem.0.0019","Abstract.Note":"","Date":"2008","Pages":"489-514","Issue":3,"Volume":45,"Editor":""},{"Key":"JZ37NFAH","Item.Type":"journalArticle","Publication.Year":2005,"Author":"Bauld, L.; Judge, K.; Barnes, M.; Benzeval, M.; MacKenzie, M.; Sullivan, H.","Title":"Promoting social change: The experience of health action zones in England","Publication.Title":"Journal of Social Policy","DOI":"","Abstract.Note":"","Date":"2005","Pages":"427-455","Volume":34,"Editor":""},{"Key":"RSQ7BWB6","Item.Type":"journalArticle","Publication.Year":2012,"Author":"Hong, Seong-Yun; O'Sullivan, David","Title":"Detecting ethnic residential clusters using an optimisation clustering method","Publication.Title":"International Journal of Geographical Information Science","DOI":"10.1080/13658816.2011.637045","Abstract.Note":"","Date":"2012","Pages":"1-21","Editor":""},{"Key":"SPSU6A5I","Item.Type":"bookSection","Publication.Year":2012,"Author":"O'Sullivan, David; Millington, James; Perry, George; Wainwright, John","Title":"Agent-Based Models – Because They’re Worth It? Agent-Based Models of Geographical Systems","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2012","Pages":"109-123","Editor":"Heppenstall, Alison J.; Crooks, Andrew T.; See, Linda M.; Batty, Michael"},{"Key":"3GWNU7U6","Item.Type":"journalArticle","Publication.Year":1999,"Author":"O'Sullivan, David","Title":"Exploring the structure of space: towards geocomputational theory","Publication.Title":"Geocomputation 99","DOI":"","Abstract.Note":"","Date":"1999","Pages":"","Editor":""},{"Key":"83U56FKJ","Item.Type":"journalArticle","Publication.Year":2002,"Author":"O'Sullivan, David","Title":"What about people in geographic information science?","Publication.Title":"Second International Conference, GIScience 2002","DOI":"","Abstract.Note":"","Date":"2002","Pages":"","Editor":""},{"Key":"M5QIWMA5","Item.Type":"journalArticle","Publication.Year":2002,"Author":"O'Sullivan, David","Title":"Understanding the difference that space can make: toward a geographical agent modeling environment","Publication.Title":"Agent 2002 'Social Agents: Ecology, Exchange, and Evolution'","DOI":"","Abstract.Note":"","Date":"2002","Pages":"","Editor":""},{"Key":"75ZB8PMZ","Item.Type":"report","Publication.Year":2004,"Author":"O'Sullivan, David; Macgill, James R.; Gahegan, Mark N.","Title":"Geographically enhanced agent-based models with geovisualization support","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2004","Pages":"","Editor":""},{"Key":"QGISNWIC","Item.Type":"bookSection","Publication.Year":2001,"Author":"O'Sullivan, David; Torrens, Paul M.","Title":"Cellular models of urban systems","Publication.Title":"Theoretical and Practical Issues on Cellular Automata: Proceedings of the Fourth International Conference on Cellular Automata for Research and Industry","DOI":"","Abstract.Note":"","Date":"2001","Pages":"108-116","Editor":""},{"Key":"4E6NNZ7U","Item.Type":"journalArticle","Publication.Year":2004,"Author":"O'Sullivan, David; Wong, David W. S.","Title":"A density surface-based approach to measuring spatial segregation","Publication.Title":"100th Annual Meeting of the Association of American Geographers","DOI":"","Abstract.Note":"","Date":"2004","Pages":"","Editor":""},{"Key":"83QFCT72","Item.Type":"journalArticle","Publication.Year":1999,"Author":"Schelhorn, Thorsten; O'Sullivan, David; Haklay, Mordechay; Thurstain-Goodwin, Mark","Title":"STREETS: an agent-based pedestrian model","Publication.Title":"Computers in Urban Planning and Urban Management","DOI":"","Abstract.Note":"","Date":"1999","Pages":"","Editor":""},{"Key":"INWA5TH8","Item.Type":"journalArticle","Publication.Year":2016,"Author":"Liu, Cheng; O'Sullivan, David","Title":"An abstract model of gentrification as a spatially contagious succession process","Publication.Title":"Computers, Environment and Urban Systems","DOI":"10.1016/j.compenvurbsys.2016.04.004","Abstract.Note":"","Date":"2016-09","Pages":"1-10","Volume":59,"Editor":""},{"Key":"5GJADVVE","Item.Type":"journalArticle","Publication.Year":2015,"Author":"O’Sullivan, David","Title":"Exploring spatial scale in geography","Publication.Title":"International Journal of Geographical Information Science","DOI":"10.1080/13658816.2015.1053890","Abstract.Note":"","Date":"2015-10-03","Pages":"1932-1933","Issue":10,"Volume":29,"Editor":""},{"Key":"KUFJVCP7","Item.Type":"book","Publication.Year":2014,"Author":"","Title":"Developments in the theory and practice of cybercartography: applications and indigenous mapping","Publication.Title":"","DOI":"","Abstract.Note":"Cybercartography is a new paradigm for maps and mapping in the information era. Defined as \"the organization, presentation, analysis and communication of spatially referenced information on a wide variety of topics of interest to society,\" cybercartography is presented in an interactive, dynamic, multisensory format with the use of multimedia and multimodal interfaces. Developments in the Theory and Practice of Cybercartography: Applications and Indigenous Mapping examines some of the recent developments in the theory and practice of cybercartography and the substantial changes which have taken place since the first edition published in 2005. It continues to examine the major elements of cybercartography and emphasizes the importance of interaction between theory and practice in developing a paradigm which moves beyond the concept of Geographic Information Systems and Geographical Information Science. The seven major elements of cybercartography outlined in the first edition have been supplemented by six key ideas and the definition of cybercartography has been extended and expanded. The new practice of mapping traditional knowledge in partnership with indigenous people has led to new theoretical understanding as well as innovative cybercartographic atlases. Featuring more than 90% new and revised content, this volume is a result of a multidisciplinary team effort and has benefited from the input of partners from government, industry and aboriginal non-governmental organizations","Date":"2014","Pages":"","Editor":"Taylor, D. R. F.; Lauriault, Tracey P."},{"Key":"2RM644GP","Item.Type":"journalArticle","Publication.Year":2016,"Author":"O’Sullivan, David; Evans, Tom; Manson, Steven; Metcalf, Sara; Ligmann-Zielinska, Arika; Bone, Chris","Title":"Strategic directions for agent-based modeling: avoiding the YAAWN syndrome","Publication.Title":"Journal of Land Use Science","DOI":"10.1080/1747423X.2015.1030463","Abstract.Note":"","Date":"2016-03-03","Pages":"177-187","Issue":2,"Volume":11,"Editor":""},{"Key":"ACWT7XD7","Item.Type":"book","Publication.Year":2010,"Author":"O'Sullivan, David; Unwin, D.","Title":"Geographic information analysis","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2010","Pages":"","Editor":""},{"Key":"7PCWHZNS","Item.Type":"journalArticle","Publication.Year":2016,"Author":"Cheung, Alan Kwok Lun; Brierley, Gary; O’Sullivan, David","Title":"Landscape structure and dynamics on the Qinghai-Tibetan Plateau","Publication.Title":"Ecological Modelling","DOI":"10.1016/j.ecolmodel.2016.07.015","Abstract.Note":"","Date":"2016-11","Pages":"7-22","Volume":339,"Editor":""},{"Key":"GIZD7UKT","Item.Type":"book","Publication.Year":2016,"Author":"","Title":"Geographic Information Science","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2016","Pages":"","Volume":9927,"Editor":"Miller, Jennifer A.; O'Sullivan, David; Wiegand, Nancy"},{"Key":"8PE2BVRF","Item.Type":"thesis","Publication.Year":2000,"Author":"O'Sullivan, David","Title":"Graph-based Cellular Automaton Models of Urban Spatial Processes","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2000","Pages":"","Editor":""},{"Key":"ZQUWNQI2","Item.Type":"book","Publication.Year":2016,"Author":"","Title":"Geographic Information Science","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2016","Pages":"","Volume":9927,"Editor":"Miller, Jennifer A.; O'Sullivan, David; Wiegand, Nancy"},{"Key":"4BBKUFC8","Item.Type":"bookSection","Publication.Year":2014,"Author":"O’Sullivan, David","Title":"Spatial Network Analysis","Publication.Title":"Handbook of Regional Science","DOI":"","Abstract.Note":"","Date":"2014","Pages":"1253-1273","Editor":"Fischer, Manfred M.; Nijkamp, Peter"},{"Key":"JIS88M9H","Item.Type":"journalArticle","Publication.Year":2008,"Author":"O'Sullivan, D.","Title":"Geographical information science: agent-based models","Publication.Title":"Progress in Human Geography","DOI":"10.1177/0309132507086879","Abstract.Note":"","Date":"2008-02-08","Pages":"541-550","Issue":4,"Volume":32,"Editor":""},{"Key":"GI4F9VM2","Item.Type":"journalArticle","Publication.Year":2007,"Author":"O'Sullivan, David; Wong, David WS","Title":"A Surface-Based Approach to Measuring Spatial Segregation","Publication.Title":"Geographical Analysis","DOI":"","Abstract.Note":"","Date":"2007","Pages":"147–168","Issue":2,"Volume":39,"Editor":""},{"Key":"TWAFDIQF","Item.Type":"journalArticle","Publication.Year":2016,"Author":"Thatcher, J.; OSullivan, D.; Mahmoudi, D.","Title":"Data colonialism through accumulation by dispossession: New metaphors for daily data","Publication.Title":"Environment and Planning D: Society and Space","DOI":"10.1177/0263775816633195","Abstract.Note":"","Date":"2016-12-01","Pages":"990-1006","Issue":6,"Volume":34,"Editor":""},{"Key":"TAICT8WU","Item.Type":"journalArticle","Publication.Year":2017,"Author":"Harris, Richard; O’Sullivan, David; Gahegan, Mark; Charlton, Martin; Comber, Lex; Longley, Paul; Brunsdon, Chris; Malleson, Nick; Heppenstall, Alison; Singleton, Alex; Arribas-Bel, Dani; Evans, Andy","Title":"More bark than bytes? Reflections on 21+ years of geocomputation","Publication.Title":"Environment and Planning B: Urban Analytics and City Science","DOI":"","Abstract.Note":"","Date":"2017","Pages":"598–617","Issue":4,"Volume":44,"Editor":""},{"Key":"5IS89X2J","Item.Type":"journalArticle","Publication.Year":2016,"Author":"Liu, Cheng; O'Sullivan, David","Title":"An abstract model of gentrification as a spatially contagious succession process","Publication.Title":"Computers, Environment and Urban Systems","DOI":"10.1016/j.compenvurbsys.2016.04.004","Abstract.Note":"","Date":"2016-09","Pages":"1-10","Volume":59,"Editor":""},{"Key":"9QWD7PSB","Item.Type":"bookSection","Publication.Year":2016,"Author":"Thatcher, Jim; Bergmann, Luke; O'Sullivan, David","Title":"Searching for common ground (again)","Publication.Title":"International Conference on GIScience Short Paper Proceedings","DOI":"","Abstract.Note":"","Date":"2016","Pages":"3014-307","Editor":"Miller, Jennifer A.; O'Sullivan, David; Wiegand, Nancy"},{"Key":"24HW82BC","Item.Type":"bookSection","Publication.Year":2008,"Author":"O'Sullivan, David","Title":"Neural Networks","Publication.Title":"Encyclopedia of Geographic Information Science","DOI":"","Abstract.Note":"","Date":"2008","Pages":"","Editor":""},{"Key":"EKW8E9XZ","Item.Type":"journalArticle","Publication.Year":2017,"Author":"Bergmann, Luke; O'Sullivan, David","Title":"Reimagining GIScience for relational spaces","Publication.Title":"The Canadian Geographer / Le Géographe canadien","DOI":"10.1111/cag.12405","Abstract.Note":"","Date":"2017-09-18","Pages":"","Editor":""},{"Key":"U3NMUDM8","Item.Type":"journalArticle","Publication.Year":2018,"Author":"Perry, George L. W.; O’Sullivan, David","Title":"Identifying Narrative Descriptions in Agent-Based Models Representing Past Human-Environment Interactions","Publication.Title":"Journal of Archaeological Method and Theory","DOI":"10.1007/s10816-017-9355-x","Abstract.Note":"","Date":"2018","Pages":"795-813","Issue":3,"Volume":25,"Editor":""},{"Key":"5VL77M76","Item.Type":"conferencePaper","Publication.Year":2017,"Author":"Bergmann, Luke R.; O'Sullivan, David","Title":"Computing with many spaces: Generalizing projections for the digital geohumanities and GIScience","Publication.Title":"Geospatial Humanities","DOI":"10.1145/3149858.3149866","Abstract.Note":"","Date":"2017","Pages":"31-38","Editor":""},{"Key":"YYFDR2UM","Item.Type":"journalArticle","Publication.Year":2017,"Author":"O'Sullivan, David","Title":"Book review: Social-spatial segregation: concepts, processes and outcomes, edited by Christoper D. Lloyd, Ian Shuttleworth, and David W. Wong, Bristol UK: Policy Press, 2015.","Publication.Title":"Contemporary Sociology: A Journal of Reviews","DOI":"10.1177/0094306117714500z","Abstract.Note":"","Date":"2017","Pages":"455-457","Issue":4,"Volume":46,"Editor":"Lloyd, Christopher D.; Shuttleworth, Ian G.; Wong, David Wing-Shun"},{"Key":"JAU5ISV6","Item.Type":"journalArticle","Publication.Year":2018,"Author":"Getz, Wayne M.; Marshall, Charles R.; Carlson, Colin J.; Giuggioli, Luca; Ryan, Sadie J.; Romañach, Stephanie S.; Boettiger, Carl; Chamberlain, Samuel D.; Larsen, Laurel; D’Odorico, Paolo; O’Sullivan, David","Title":"Making ecological models adequate","Publication.Title":"Ecology Letters","DOI":"10.1111/ele.12893","Abstract.Note":"","Date":"2018-02","Pages":"153-166","Issue":2,"Volume":21,"Editor":"Coulson, Tim"},{"Key":"3PDCW9NU","Item.Type":"journalArticle","Publication.Year":2018,"Author":"Liu, Cheng; O’Sullivan, David; Perry, George L. W","Title":"The rent gap revisited: gentrification in point Chevalier, Auckland","Publication.Title":"Urban Geography","DOI":"10.1080/02723638.2018.1446883","Abstract.Note":"","Date":"2018-03-05","Pages":"1-26","Editor":""},{"Key":"4IMCZQ3H","Item.Type":"journalArticle","Publication.Year":2006,"Author":"O'Sullivan, David; Manson, Steven M; Messina, Joseph P; Crawford, Thomas W","Title":"Space, Place, and Complexity Science","Publication.Title":"Environment and Planning A","DOI":"10.1068/a3812","Abstract.Note":"","Date":"2006-04","Pages":"611-617","Issue":4,"Volume":38,"Editor":""},{"Key":"STDJSXM5","Item.Type":"journalArticle","Publication.Year":2018,"Author":"Thatcher, Jim E.; Bergmann, Luke; O'Sullivan, David","Title":"Speculative and constructively critical GIS","Publication.Title":"The Canadian Geographer / Le Géographe canadien","DOI":"10.1111/cag.12441","Abstract.Note":"","Date":"2018-03-01","Pages":"4-6","Issue":1,"Volume":62,"Editor":""},{"Key":"D972ITW6","Item.Type":"journalArticle","Publication.Year":2017,"Author":"Mahdavi Adrestani, Babak; O'Sullivan, David; Davis, Peter","Title":"A multi-scaled agent-based model of residential segregation applied to a real metropolitan area","Publication.Title":"Computers, Environment and Urban Systems","DOI":"10.1016/j.compenvurbsys.2017.11.002","Abstract.Note":"","Date":"2017-12","Pages":"","Editor":""},{"Key":"BLE85HMY","Item.Type":"journalArticle","Publication.Year":2006,"Author":"Manson, Steven; O'Sullivan, David","Title":"Complexity Theory in the Study of Space and Place","Publication.Title":"Environment and Planning A","DOI":"10.1068/a37100","Abstract.Note":"","Date":"2006-04","Pages":"677-692","Issue":4,"Volume":38,"Editor":""},{"Key":"H9JJQ2DY","Item.Type":"journalArticle","Publication.Year":2001,"Author":"Haklay, Mordechai; O'Sullivan, David; Thurstain-Goodwin, Mark; Schelhorn, Thorsten","Title":"“So Go Downtown”: Simulating Pedestrian Movement in Town Centres","Publication.Title":"Environment and Planning B: Planning and Design","DOI":"10.1068/b2758t","Abstract.Note":"","Date":"2001-06","Pages":"343-359","Issue":3,"Volume":28,"Editor":""},{"Key":"IMEBEEII","Item.Type":"journalArticle","Publication.Year":2018,"Author":"Adrestani, Babak Mahdavi; O'Sullivan, David; Davis, Peter","Title":"A multi-scaled agent-based model of residential segregation applied to a real metropolitan area","Publication.Title":"Computers, Environment and Urban Systems","DOI":"https://doi.org/10.1016/j.compenvurbsys.2017.11.002","Abstract.Note":"","Date":"2018","Pages":"1-16","Volume":69,"Editor":""},{"Key":"4I8TCCN7","Item.Type":"journalArticle","Publication.Year":2018,"Author":"Bergmann, Luke; O'Sullivan, David","Title":"Reimagining GIScience for relational spaces: Reimagining GIScience","Publication.Title":"The Canadian Geographer / Le Géographe canadien","DOI":"10.1111/cag.12405","Abstract.Note":"","Date":"2018-03","Pages":"7-14","Issue":1,"Volume":62,"Editor":""},{"Key":"EULNBLZ9","Item.Type":"journalArticle","Publication.Year":2012,"Author":"Hong, Seong-Yun; O'Sullivan, David","Title":"Detecting ethnic residential clusters using an optimisation clustering method","Publication.Title":"International Journal of Geographical Information Science","DOI":"10.1080/13658816.2011.637045","Abstract.Note":"","Date":"2012-08","Pages":"1457-1477","Issue":8,"Volume":26,"Editor":""},{"Key":"ZDPWDYD9","Item.Type":"journalArticle","Publication.Year":2014,"Author":"Hong, Seong-Yun; O'Sullivan, David; Sadahiro, Yukio","Title":"Implementing Spatial Segregation Measures in R","Publication.Title":"PLoS ONE","DOI":"10.1371/journal.pone.0113767","Abstract.Note":"","Date":"2014-11-21","Pages":"e113767","Issue":11,"Volume":9,"Editor":"Rocchini, Duccio"},{"Key":"GDMF9EXJ","Item.Type":"journalArticle","Publication.Year":2018,"Author":"Mavoa, Suzanne; Lamb, Karen; O’Sullivan, David; Witten, Karen; Smith, Melody","Title":"Are disadvantaged children more likely to be excluded from analysis when applying global positioning systems inclusion criteria?","Publication.Title":"BMC Research Notes","DOI":"10.1186/s13104-018-3681-2","Abstract.Note":"Objective:  When using global positioning systems (GPS) to assess an individual’s exposure to their environment, a first step in data cleaning is to establish minimum GPS ‘inclusion criteria’ (a set of rules used to determine which GPS data are able to be included in analyses). Care is needed at this stage to avoid any data exclusion (data loss) systematically biasing results in terms of characteristics of the environment and participants. The extent of potential systematic bias in sample retention due to GPS data loss and application of GPS inclusion criteria is unknown. The aim of this study was to describe differences in sample size and socio-demographic characteristics of the retained sample when applying three different GPS inclusion criteria. The study assessed 7-day GPS data collected from children (aged 9–13 years) recruited from nine schools in Auckland, New Zealand as part of the Kids in the City study. Results:  Participants from ethnic minorities and those attending schools in lower socioeconomic areas were disproportionately excluded from the retained samples. This highlights potential equity implications in basing the assessment of exposure—which ultimately influences research results on the relationship between environment and health—on non-representative GPS data.","Date":"2018-12","Pages":"","Issue":1,"Volume":11,"Editor":""},{"Key":"VNE98J5S","Item.Type":"bookSection","Publication.Year":2005,"Author":"Heppenstall, Alison J.; Evans, Andrew J.; Birkin, Mark H.; O’Sullivan, David","Title":"The Use of Hybrid Agent Based Systems to Model Petrol Markets","Publication.Title":"Agent-Based Simulation: From Modeling Methodologies to Real-World Applications","DOI":"","Abstract.Note":"The petrol price market is a highly sensitive and competitive market with many processes combining at different temporal and spatial scales to affect each petrol station's prices. Previous models developed to represent the relationship between petrol and a variable are empirical and mathematical. These suffer from a number of problems, chiefly: the parameters axe all on the same scale (behaviours executed at the 'micro' level are not tied to 'global' level variables Uke oil prices); the parameters are often difficult to estimate and lack realism; very little, if any, account of any geographical effects is taken, and, finally, mathematical models by their nature only consider quantitative parameters and therefore miss out on qualitative, behavioural information.","Date":"2005","Pages":"182-193","Volume":1,"Editor":"Terano, Takao; Kita, Hajime; Kaneda, Toshiyuki; Arai, Kiyoshi; Deguchi, Hiroshi"},{"Key":"SY9NZJ77","Item.Type":"journalArticle","Publication.Year":2018,"Author":"O’Sullivan, David","Title":"Untangling knots: Thoughts on Wilson’s <i>New Lines<\/i>","Publication.Title":"Transactions in GIS","DOI":"10.1111/tgis.12502","Abstract.Note":"","Date":"2018-11-28","Pages":"","Editor":""},{"Key":"F27YT4Q7","Item.Type":"journalArticle","Publication.Year":2018,"Author":"Christophers, Brett; O’Sullivan, David","Title":"Intersections of inequality in homeownership in Sweden","Publication.Title":"Housing Studies","DOI":"10.1080/02673037.2018.1495695","Abstract.Note":"Inequalities relating to ownership of housing have become a major issue de jour in many Western societies. This article examines how the distribution of homeownership in Sweden relates to two factors widely seen as significant to such inequalities, namely parental tenure status and place of birth. We use longitudinal registry data to examine the bearing of these two factors on individual-level tenure progression since the beginning of the 1990s for persons at different stages of their housing careers. We extend existing understandings of Swedish homeownership patterns by demonstrating that inequalities relating to place of birth and parental tenure intersect with one another in ways that substantially advantage certain subgroups while disadvantaging others, and by demonstrating that experiences of entry into homeownership have in recent years been changing in markedly different ways for these different subgroups. Overall, Swedish homeownership inequalities, far from dissipating, appear to be hardening along existing lines.","Date":"2018-12-21","Pages":"1-28","Editor":""},{"Key":"SMR8RIHK","Item.Type":"conferencePaper","Publication.Year":2016,"Author":"Thatcher, Jim; Bergmann, Luke; O'Sullivan, David","Title":"Searching for common ground (again)","Publication.Title":"International Conference on GIScience Short Paper Proceedings","DOI":"10.21433/B3118NQ409QZ","Abstract.Note":"","Date":"2016","Pages":"304-307","Editor":"Miller, Jennifer A.; O'Sullivan, David; Wiegand, Nancy"},{"Key":"2HLRJMB5","Item.Type":"journalArticle","Publication.Year":2010,"Author":"O'Sullivan, Patrick","Title":"Geopolitical Force Fields","Publication.Title":"Geographical Analysis","DOI":"10.1111/j.1538-4632.1995.tb00342.x","Abstract.Note":"","Date":"2010-09-03","Pages":"176-181","Issue":2,"Volume":27,"Editor":""},{"Key":"UIG8G5PI","Item.Type":"journalArticle","Publication.Year":2019,"Author":"Mavoa, Suzanne; Bagheri, Nasser; Koohsari, Mohammad J; Kaczynski, Andrew T; Lamb, Karen E; Oka, Koichiro; O’Sullivan, David; Witten, Karen","Title":"How Do Neighbourhood Definitions Influence the Associations between Built Environment and Physical Activity?","Publication.Title":"Int. J. Environ. Res. Public Health","DOI":"","Abstract.Note":"","Date":"2019","Pages":"16","Editor":""},{"Key":"5GUVGR9W","Item.Type":"bookSection","Publication.Year":2019,"Author":"Andris, Clio; O’Sullivan, David","Title":"Spatial Network Analysis","Publication.Title":"Handbook of Regional Science","DOI":"","Abstract.Note":"Spatial networks organize and structure human social, economic, and cultural systems. The analysis of network structure is rooted in mathematical graph theory, and spatial networks are a special type of graphs that are embedded on the earth’s surface. Thus, their analysis necessitates the fusion of graph theoretical and geographic concepts. Key concepts and deﬁnitions from graph theory are reviewed and used to develop a variety of graph structural measures, which can be used to investigate local and global network structure. Particular emphasis is placed on three major concepts: high-level network structural features of centrality, cohesive subgraphs, and structural equivalence. With these metrics in mind, we describe considerations for their use within a spatial context. Pointers to empirical research on real-world spatial networks are provided.","Date":"2019","Pages":"1-24","Editor":"Fischer, Manfred M.; Nijkamp, Peter"},{"Key":"VMVB7K5C","Item.Type":"journalArticle","Publication.Year":2006,"Author":"Manson, Steven; O'Sullivan, David","Title":"Complexity Theory in the Study of Space and Place","Publication.Title":"Environment and Planning A: Economy and Space","DOI":"10.1068/a37100","Abstract.Note":"Researchers across disciplines apply complexity theory to issues ranging from economic development to earthquake prediction. The breadth of applications speaks to the promise of complexity theory, but there remain a number of challenges to be met, particularly those related to its ontological and epistemological dimensions. We identify a number of key issues by asking three questions. Does complexity theory operate at too general a level to enhance understanding? What are the ontological and epistemological implications of complexity? What are the challenges in modeling complexity? In answering these questions, we argue that, although complexity offers much to the study of place and space, research in these areas has a number of strengths that enhance complexity research.","Date":"2006-04","Pages":"677-692","Issue":4,"Volume":38,"Editor":""},{"Key":"H4QZPQ5K","Item.Type":"journalArticle","Publication.Year":2019,"Author":"O'Sullivan, David","Title":"Things Are How They Are Because of How They Got That Way: Thoughts from the Beach, on 50 Years of <i>Geographical Analysis<\/i>","Publication.Title":"Geographical Analysis","DOI":"10.1111/gean.12225","Abstract.Note":"","Date":"2019-12","Pages":"gean.12225","Editor":""},{"Key":"EQXLYIIG","Item.Type":"book","Publication.Year":2013,"Author":"O'Sullivan, David; Perry, George L. W.","Title":"Spatial simulation: exploring pattern and process","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2013","Pages":"","Editor":""},{"Key":"H4Z37Q4F","Item.Type":"journalArticle","Publication.Year":2020,"Author":"O'Sullivan, David; Gahegan, Mark; Exeter, Daniel J.; Adams, Benjamin","Title":"Spatially explicit models for exploring COVID‐19 lockdown strategies","Publication.Title":"Transactions in GIS","DOI":"10.1111/tgis.12660","Abstract.Note":"","Date":"2020-06-15","Pages":"tgis.12660","Editor":""},{"Key":"49WRANTM","Item.Type":"journalArticle","Publication.Year":2020,"Author":"Manson, Steven; An, Li; Clarke, Keith C.; Heppenstall, Alison; Koch, Jennifer; Krzyzanowski, Brittany; Morgan, Fraser; O'Sullivan, David; Runck, Bryan C; Shook, Eric; Tesfatsion, Leigh","Title":"Methodological Issues of Spatial Agent-Based Models","Publication.Title":"Journal of Artificial Societies and Social Simulation","DOI":"10.18564/jasss.4174","Abstract.Note":"Agent based modeling (ABM) is a standard tool that is useful across many disciplines. Despite widespread and mounting interest in ABM, even broader adoption has been hindered by a set of methodological challenges that run from issues around basic tools to the need for a more complete conceptual foundation for the approach. A er several decades of progress, ABMs remain di icult to develop and use for many students, scholars, and policy makers. This di iculty holds especially true for models designed to represent spatial patterns and processes across a broad range of human, natural, and human-environment systems. In this paper, we describe the methodological challenges facing further development and use of spatial ABM (SABM) and suggest some potential solutions from multiple disciplines. We first define SABM to narrow our object of inquiry, and then explore how spatiality is a source of both advantages and challenges. We examine how time interacts with space in models and delve into issues of model development in general and modeling frameworks and tools specifically. We draw on lessons and insights from fields with a history of ABM contributions, including economics, ecology, geography, ecology, anthropology, and spatial science with the goal of identifying promising ways forward for this powerful means of modeling.","Date":"2020","Pages":"3","Issue":1,"Volume":23,"Editor":""},{"Key":"IEQHMLA5","Item.Type":"journalArticle","Publication.Year":2020,"Author":"Payne, Will B.; O’Sullivan, David","Title":"Exploding the Phone Book: Spatial Data Arbitrage in the 1990s Internet Boom","Publication.Title":"Annals of the American Association of Geographers","DOI":"10.1080/24694452.2019.1656999","Abstract.Note":"","Date":"2020-03-03","Pages":"391-398","Issue":2,"Volume":110,"Editor":""},{"Key":"VR97I6NZ","Item.Type":"journalArticle","Publication.Year":2020,"Author":"O'Sullivan, David; Gahegan, Mark; Exeter, Daniel J.; Adams, Benjamin","Title":"Spatially explicit models for exploring COVID-19 lockdown strategies","Publication.Title":"Transactions in GIS","DOI":"https://doi.org/10.1111/tgis.12660","Abstract.Note":"This article describes two spatially explicit models created to allow experimentation with different societal responses to the COVID-19 pandemic. We outline the work to date on modeling spatially explicit infective diseases and show that there are gaps that remain important to fill. We demonstrate how geographical regions, rather than a single, national approach, are likely to lead to better outcomes for the population. We provide a full account of how our models function, and how they can be used to explore many different aspects of contagion, including: experimenting with different lockdown measures, with connectivity between places, with the tracing of disease clusters, and the use of improved contact tracing and isolation. We provide comprehensive results showing the use of these models in given scenarios, and conclude that explicitly regionalized models for mitigation provide significant advantages over a “one-size-fits-all” approach. We have made our models, and their data, publicly available for others to use in their own locales, with the hope of providing the tools needed for geographers to have a voice during this difficult time.","Date":"2020","Pages":"967-1000","Issue":4,"Volume":24,"Editor":""},{"Key":"JAISMKHU","Item.Type":"journalArticle","Publication.Year":2021,"Author":"Franklin, Rachel S.; Houlden, Victoria; Robinson, Caitlin; Arribas-Bel, Daniel; Delmelle, Elizabeth C.; Demšar, Urška; Miller, Harvey J.; O’Sullivan, David","Title":"Who Counts? Gender, Gatekeeping, and Quantitative Human Geography","Publication.Title":"The Professional Geographer","DOI":"10.1080/00330124.2020.1828944","Abstract.Note":"","Date":"2021-01-02","Pages":"48-61","Issue":1,"Volume":73,"Editor":""},{"Key":"I2S5EI2V","Item.Type":"journalArticle","Publication.Year":2021,"Author":"O'Sullivan, David","Title":"New mappings of GIScience and geography. A commentary on May Yuan's ‘GIS research to address tensions in geography’","Publication.Title":"Singapore Journal of Tropical Geography","DOI":"10.1111/sjtg.12345","Abstract.Note":"","Date":"2021-01","Pages":"31-35","Issue":1,"Volume":42,"Editor":""},{"Key":"V9QIT8R5","Item.Type":"book","Publication.Year":2010,"Author":"O'Sullivan, David; Unwin, D.","Title":"Geographic information analysis","Publication.Title":"","DOI":"","Abstract.Note":"","Date":"2010","Pages":"","Editor":""},{"Key":"PHMT92EM","Item.Type":"journalArticle","Publication.Year":2018,"Author":"O'Sullivan, David; Bergmann, Luke; Thatcher, Jim E.","Title":"Spatiality, Maps, and Mathematics in Critical Human Geography: Toward a Repetition with Difference","Publication.Title":"The Professional Geographer","DOI":"10.1080/00330124.2017.1326081","Abstract.Note":"","Date":"2018-01-02","Pages":"129-139","Issue":1,"Volume":70,"Editor":""}]
